{"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 1, 96, 96], "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"b_constraint": null, "nb_col": 2, "nb_filter": 24, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "nb_row": 2, "trainable": true, "border_mode": "same", "activation": "relu", "bias": true, "dim_ordering": "tf", "W_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "init": "glorot_uniform"}, "name": "convolution2d_1"}, {"class_name": "Dropout", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"p": 0.25, "trainable": true, "name": "dropout_1"}, "name": "dropout_1"}, {"class_name": "Flatten", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0]]], "config": {"b_constraint": null, "output_dim": 512, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "relu", "name": "dense_1", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}, "name": "dense_1"}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "name": "dropout_2"}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"b_constraint": null, "output_dim": 2, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "softmax", "name": "dense_2", "W_regularizer": null, "input_dim": null, "W_constraint": null, "init": "glorot_uniform", "bias": true}, "name": "dense_2"}]}, "keras_version": "1.1.2"}